In [17]:
import sqlite3

db = sqlite3.connect("Student.db")
db.execute("drop table if exists grades")
db.execute("create table grades(id int, name text, score int)")
db.execute("insert into grades(id, name, score) values(1,'John', 97)")
db.execute("insert into grades(id, name, score) values(2, 'Smith', 100)")
db.commit()

results = db.execute("select * from grades order by id")

for row in results:
    print row
    
    #print row.decode('unicode_escape').encode('ascii','ignore')

(1, u'John', 97)
(2, u'Smith', 100)

In [16]:
import sqlite3

db = sqlite3.connect("Student.db")
db.execute("drop table if exists grades")
db.execute("create table grades(id int, name text, score int)")
db.execute("insert into grades(id, name, score) values(1,'John', 97)")
db.execute("insert into grades(id, name, score) values(2, 'Smith', 100)")
db.execute("insert into grades(id, name, score) values(3,'Jane', 98)")
db.execute("insert into grades(id, name, score) values(4, 'Doe', 90)")
db.execute("insert into grades(id, name, score) values(5,'James', 85)")
db.execute("insert into grades(id, name, score) values(6, 'Tom', 82)")
db.commit()

In [19]:
results = db.execute("select * from grades order by id")

for row in results:
    print row

(1, u'John', 97)
(2, u'Smith', 100)
(3, u'Jane', 98)
(4, u'Doe', 90)
(5, u'James', 85)
(6, u'Tom', 82)

In [6]:
results = db.execute("select id, name from grades where name = 'Jane'")

for row in results:
    print row

(3, u'Jane')

In [33]:
results = db.execute("select * from grades where score < 85")

for row in results:
    print row

(6, u'Tom', 82)

In [42]:
results = db.execute("select name, score from grades")

for row in results:
    print row

(u'John', 97)
(u'Smith', 100)
(u'Jane', 98)
(u'Doe', 90)
(u'James', 85)
(u'Tom', 82)

In [16]:
import sqlite3

db = sqlite3.connect("Student.db")
db.execute("drop table if exists grades")
db.execute("create table grades(id int, name text, score int)")
db.execute("insert into grades(id, name, score) values(1,'John', 97)")
db.execute("insert into grades(id, name, score) values(2, 'Smith', 100)")
db.execute("insert into grades(id, name, score) values(3,'Jane', 98)")
db.execute("insert into grades(id, name, score) values(4, 'Doe', 90)")
db.execute("insert into grades(id, name, score) values(5,'James', 85)")
db.execute("insert into grades(id, name, score) values(6, 'Tom', 82)")
db.commit()

db.execute("update grades set name='Jack' where score=82")
db.commit()

In [18]:
import pandas as pd

con = sqlite3.connect("Student.db")
q = "Select * from grades"
df = pd.read_sql(q, con)
df

   id   name  score
0   1   John     97
1   2  Smith    100
2   3   Jane     98
3   4    Doe     90
4   5  James     85
5   6   Jack     82

In [4]:

import pandas
pandas.read_sql_table(grades, db, schema=None, index_col=None, coerce_float=True, parse_dates=None, columns=None, chunksize=None)

NameError: name 'pwd' is not defined

In [5]:
pwd

u'/Users/samishumiye'

In [11]:
import sqlite3

db = sqlite3.connect("Student1.db")
db.execute("drop table if exists grades1")
db.execute("create table grades1(id int, name text, score int)")
db.execute("insert into grades1(id, name, score) values(1,'John', 97)")
db.execute("insert into grades1(id, name, score) values(2, 'Smith', 100)")
db.commit()

results = db.execute("select * from grades1 order by id")

for row in results:
    print row

(1, u'John', 97)
(2, u'Smith', 100)

In [14]:
con = sqlite3.connect('Student1.sqlite')

dataset = pandas.read_sql_query("SELECT * FROM grades1", con)

In [15]:
dataset

   id   name  score
0   1   John     97
1   2  Smith    100

In [ ]:
# http://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_sql_table.html#pandas.read_sql_table

In [28]:
import sqlite3

db = sqlite3.connect("StudentList.db")
db.execute("drop table if exists student_info")
db.execute("create table student_info(id int, name text, score int , grade int, state text)")
db.execute("insert into student_info(id, name, score, grade, state) values(1,'John',97,11,'CA')")
db.execute("insert into student_info(id, name, score,grade,state) values(2, 'Smith',87,12,'NY')")
db.execute("insert into student_info(id, name, score, grade, state) values(3,'Jane',97,10,'SF')")
db.execute("insert into student_info(id, name, score,grade,state) values(4, 'Julie',87,9,'LA')")
db.execute("insert into student_info(id, name, score, grade, state) values(5,'Jack',97,7,'VA')")
db.execute("insert into student_info(id, name, score,grade,state) values(6, 'Karen',99,12,'DC')")
db.execute("insert into student_info(id, name, score, grade, state) values(7,'Lucy',63,11,'NC')")
db.execute("insert into student_info(id, name, score,grade,state) values(8, 'Mark',81,10,'CT')")
db.execute("insert into student_info(id, name, score, grade, state) values(9,'Terry',67,8,'AZ')")
db.execute("insert into student_info(id, name, score,grade,state) values(10, 'Newman',77,9,'MD')")
db.execute("insert into student_info(id, name, score, grade, state) values(11,'Kevin',67,2,'NJ')")
db.execute("insert into student_info(id, name, score,grade,state) values(12, 'Sami',81,3,'SC')")
db.execute("insert into student_info(id, name, score, grade, state) values(13,'Paul',92,4,'PA')")
db.execute("insert into student_info(id, name, score,grade,state) values(14, 'Jamie',86,5,'LV')")
db.execute("insert into student_info(id, name, score, grade, state) values(15,'Jackie',57,6,'TX')")
db.execute("insert into student_info(id, name, score,grade,state) values(16, 'Maria',90,7,'UT')")
db.execute("insert into student_info(id, name, score, grade, state) values(17,'Marta',69,8,'MA')")
db.execute("insert into student_info(id, name, score,grade,state) values(18, 'Muller',88,10,'CT')")
db.execute("insert into student_info(id, name, score, grade, state) values(19,'Tiara',77,8,'AZ')")
db.execute("insert into student_info(id, name, score,grade,state) values(20, 'James',79,9,'MD')")
db.commit()

#db.execute("update grades set name='Jack' where score=82")
#db.commit()

In [29]:
results = db.execute("select * from student_info order by id")

for row in results:
    print row

(1, u'John', 97, 11, u'CA')
(2, u'Smith', 87, 12, u'NY')
(3, u'Jane', 97, 10, u'SF')
(4, u'Julie', 87, 9, u'LA')
(5, u'Jack', 97, 7, u'VA')
(6, u'Karen', 99, 12, u'DC')
(7, u'Lucy', 63, 11, u'NC')
(8, u'Mark', 81, 10, u'CT')
(9, u'Terry', 67, 8, u'AZ')
(10, u'Newman', 77, 9, u'MD')
(11, u'Kevin', 67, 2, u'NJ')
(12, u'Sami', 81, 3, u'SC')
(13, u'Paul', 92, 4, u'PA')
(14, u'Jamie', 86, 5, u'LV')
(15, u'Jackie', 57, 6, u'TX')
(16, u'Maria', 90, 7, u'UT')
(17, u'Marta', 69, 8, u'MA')
(18, u'Muller', 88, 10, u'CT')
(19, u'Tiara', 77, 8, u'AZ')
(20, u'James', 79, 9, u'MD')

In [30]:
con = sqlite3.connect('StudentList.db')

dframe = pandas.read_sql_query("SELECT * FROM student_info", con)

In [31]:
dframe

    id    name  score  grade state
0    1    John     97     11    CA
1    2   Smith     87     12    NY
2    3    Jane     97     10    SF
3    4   Julie     87      9    LA
4    5    Jack     97      7    VA
5    6   Karen     99     12    DC
6    7    Lucy     63     11    NC
7    8    Mark     81     10    CT
8    9   Terry     67      8    AZ
9   10  Newman     77      9    MD
10  11   Kevin     67      2    NJ
11  12    Sami     81      3    SC
12  13    Paul     92      4    PA
13  14   Jamie     86      5    LV
14  15  Jackie     57      6    TX
15  16   Maria     90      7    UT
16  17   Marta     69      8    MA
17  18  Muller     88     10    CT
18  19   Tiara     77      8    AZ
19  20   James     79      9    MD

In [32]:
#Select just a few columns


dframe = pd.read_sql_query('SELECT id, name, score FROM student_info', con)
dframe.head()

   id   name  score
0   1   John     97
1   2  Smith     87
2   3   Jane     97
3   4  Julie     87
4   5   Jack     97

In [ ]:
#Select just a few columns
# LIMIT the number of rows that are retrieved
# Filter rows with WHERE
# Filter multiple values in a column with WHERE and IN
# Filter multiple values in a column with WHERE and IN and ORDER BY --
# Find the unique values in a column with DISTINCT
#Query value counts with COUNT(*) and GROUP BY

In [34]:
# LIMIT the number of rows that are retrieved

dframe = pd.read_sql_query('SELECT id, name, score FROM student_info LIMIT 4', con)
dframe.head()

   id   name  score
0   1   John     97
1   2  Smith     87
2   3   Jane     97
3   4  Julie     87

In [ ]:
dframe = pd.read_sql_query('SELECT id, name, score FROM student_info', con)
dframe.head()

In [27]:
# Filter rows with WHERE

dframe = pd.read_sql_query('SELECT id, name, score FROM student_info WHERE grade = 11', con)
dframe

   id  name  score
0   1  John     97
1   7  Lucy     63

In [35]:
# Filter multiple values in a column with WHERE and IN

dframe = pd.read_sql_query('SELECT * FROM student_info WHERE state IN ("MD","AZ","SC")', con)
dframe

   id    name  score  grade state
0   9   Terry     67      8    AZ
1  10  Newman     77      9    MD
2  12    Sami     81      3    SC
3  19   Tiara     77      8    AZ
4  20   James     79      9    MD

In [38]:
# Filter multiple values in a column with WHERE and IN

dframe = pd.read_sql_query('SELECT * FROM student_info WHERE grade IN (8, 11, 12)', con)
dframe

   id   name  score  grade state
0   1   John     97     11    CA
1   2  Smith     87     12    NY
2   6  Karen     99     12    DC
3   7   Lucy     63     11    NC
4   9  Terry     67      8    AZ
5  17  Marta     69      8    MA
6  19  Tiara     77      8    AZ

In [39]:
# Filter multiple values in a column with WHERE and IN and ORDER BY --

dframe = pd.read_sql_query('SELECT * FROM student_info WHERE grade IN (8, 11, 12) ORDER BY grade', con)
dframe

   id   name  score  grade state
0   9  Terry     67      8    AZ
1  17  Marta     69      8    MA
2  19  Tiara     77      8    AZ
3   1   John     97     11    CA
4   7   Lucy     63     11    NC
5   2  Smith     87     12    NY
6   6  Karen     99     12    DC

In [36]:
# Find the unique values in a column with DISTINCT

dframe = pd.read_sql_query('SELECT DISTINCT  state FROM student_info', con)
dframe

   state
0     CA
1     NY
2     SF
3     LA
4     VA
5     DC
6     NC
7     CT
8     AZ
9     MD
10    NJ
11    SC
12    PA
13    LV
14    TX
15    UT
16    MA

In [37]:
#Query value counts with COUNT(*) and GROUP BY
dframe = pd.read_sql_query("SELECT state, COUNT(*) as 'num_of_studs' FROM student_info GROUP BY state", con)
dframe

   state  num_of_studs
0     AZ             2
1     CA             1
2     CT             2
3     DC             1
4     LA             1
5     LV             1
6     MA             1
7     MD             2
8     NC             1
9     NJ             1
10    NY             1
11    PA             1
12    SC             1
13    SF             1
14    TX             1
15    UT             1
16    VA             1

In [11]:
import sqlite3

db = sqlite3.connect("Student.lite")
db.execute("drop table if exists grades")
db.execute("create table grades(id int, name text, score int)")
db.execute("insert into grades(id, name, score) values(1,'John', 97)")
db.execute("insert into grades(id, name, score) values(2, 'Smith', 100)")
db.commit()

results = db.execute("select * from grades order by id")

for row in results:
    print row
    print str(row)

(1, u'John', 97)
(1, u'John', 97)
(2, u'Smith', 100)
(2, u'Smith', 100)